ErpTest/src/InformationRegisters/уатТиповыеДокументы/уатТиповыеДокументы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>уатТиповыеДокументы</name>
  <comment>(уат)</comment>
  <dimensions>
    <name>ДокументУАТ</name>
    <type>
      <types>DocumentRef.уатЗаказГрузоотправителя</types>
      <types>DocumentRef.уатПутевойЛист</types>
      <types>DocumentRef.уатОперацииСТехническимиЖидкостями</types>
      <types>DocumentRef.уатТТД</types>
      <types>DocumentRef.уатЗаправкаГСМ</types>
      <types>DocumentRef.уатСливГСМ</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТиповойДокумент</name>
    <comment>Документ типовой конфигурации 1С</comment>
    <type>
      <types>DocumentRef.ВнутреннееПотреблениеТоваров</types>
      <types>DocumentRef.ПриобретениеТоваровУслуг</types>
      <types>DocumentRef.ВозвратТоваровПоставщику</types>
      <types>DocumentRef.ВыработкаСотрудников</types>
      <types>DocumentRef.ПрочиеДоходыРасходы</types>
      <types>DocumentRef.СписаниеНедостачТоваров</types>
      <types>DocumentRef.ПеремещениеТоваров</types>
      <types>DocumentRef.РеализацияТоваровУслуг</types>
      <types>DocumentRef.РегистрацияНаработок</types>
      <types>DocumentRef.АвансовыйОтчет</types>
      <types>DocumentRef.НачислениеЗарплаты</types>
      <types>DocumentRef.ОприходованиеИзлишковТоваров</types>
      <types>DocumentRef.СчетНаОплатуКлиенту</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ErpTest/src/Enums/уатВидыОперацийСТехническимиЖидкостями/уатВидыОперацийСТехническимиЖидкостями.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>уатВидыОперацийСТехническимиЖидкостями</name>
  <comment>(уат)</comment>
  <enumValues>
    <name>РасходВРаботе</name>
  </enumValues>
  <enumValues>
    <name>РасходПрочее</name>
  </enumValues>
  <enumValues>
    <name>ДоливПоАкту</name>
  </enumValues>
  <enumValues>
    <name>ДоливПоТО</name>
  </enumValues>
  <enumValues>
    <name>ДоливПрочее</name>
  </enumValues>
  <enumValues>
    <name>Слив</name>
  </enumValues>
</mdclass:Enum>

ErpTest/src/Enums/уатВидыОперацийСливГСМ/уатВидыОперацийСливГСМ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>уатВидыОперацийСливГСМ</name>
  <enumValues>
    <name>НаСклад</name>
    <comment>Слив ГСМ на склад</comment>
  </enumValues>
  <enumValues>
    <name>НаТС</name>
    <comment>Слив ГСМ на другое ТС</comment>
  </enumValues>
  <enumValues>
    <name>НаАЗС</name>
  </enumValues>
</mdclass:Enum>

ErpTest/src/CommonModules/уатТиповыеДокументы/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// Процедуры и функции для работы со сформированными документами типовых конфигураций.
//  
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Процедура обрабатывает нажатие кнопки "ТД" в формах списков документов,
//	на основании которых могут формироваться типовые документы
//
Процедура ВвестиТиповойДокументСервер(ДокументУАТ, ДопПараметры = Неопределено) Экспорт
	ИмяДокумента = ДокументУАТ.Метаданные().Имя;
	
	СтруктураПараметров = Новый Структура(
		"ДокументУАТ, ФормироватьТолькоНовые, ФормироватьОбщийТД, ДатаОбщегоТД, Контрагент");
	СтруктураПараметров.ДокументУАТ = Документы[ИмяДокумента];
	СтруктураПараметров.ФормироватьОбщийТД 	= Ложь;
	СтруктураПараметров.ФормироватьТолькоНовые = Истина;
	Если ИмяДокумента = "уатПутевойЛист" Тогда
		Если ТипЗнч(ДопПараметры) = Тип("Структура") И ДопПараметры.Свойство("ВидыТД") Тогда
			СтруктураПараметров.Вставить("ФормироватьВырабСотр", ДопПараметры.ВидыТД.Найти("ПЛ_ВырабСотр") <> Неопределено);
			СтруктураПараметров.Вставить("ФормироватьТребНакл", ДопПараметры.ВидыТД.Найти("ПЛ_ТребованиеНакладная") <> Неопределено);
			СтруктураПараметров.Вставить("ФормироватьСписание", ДопПараметры.ВидыТД.Найти("ПЛ_СписаниеТоваров") <> Неопределено);
			СтруктураПараметров.Вставить("ФормироватьПрочиеДоходыРасходы", ДопПараметры.ВидыТД.Найти("ПЛ_ПрочиеДоходыРасходы") <> Неопределено);
			СтруктураПараметров.Вставить("ФормироватьРегистрацияНаработок", ДопПараметры.ВидыТД.Найти("ПЛ_РегистрацияНаработок") <> Неопределено);
		Иначе
			СтруктураПараметров.Вставить("ФормироватьВырабСотр", Истина);
			СтруктураПараметров.Вставить("ФормироватьТребНакл", Истина);
			СтруктураПараметров.Вставить("ФормироватьСписание", Ложь);
			СтруктураПараметров.Вставить("ФормироватьПрочиеДоходыРасходы", Истина);
			СтруктураПараметров.Вставить("ФормироватьРегистрацияНаработок", Истина);
		КонецЕсли;
		
	ИначеЕсли ИмяДокумента = "уатЗаправкаГСМ" Тогда
		СтруктураПараметров.Вставить("ФормироватьАвОтч", Истина);
		СтруктураПараметров.Вставить("ФормироватьПеремещТов", Истина);
		СтруктураПараметров.Вставить("ФормироватьПоступТовУслуг", Истина);
		СтруктураПараметров.Вставить("ФормироватьТребНакл", Истина);
		
	ИначеЕсли ИмяДокумента = "уатТТД" Тогда
		Если ТипЗнч(ДопПараметры) = Тип("Структура") И ДопПараметры.Свойство("ВидыТД") Тогда
			СтруктураПараметров.Вставить("ФормироватьРеализацию", ДопПараметры.ВидыТД.Найти("ТТД_Реализация") <> Неопределено);
			СтруктураПараметров.Вставить("ФормироватьСчетНаОплату", ДопПараметры.ВидыТД.Найти("ТТД_Счет") <> Неопределено);
		Иначе
			СтруктураПараметров.Вставить("ФормироватьРеализацию", Истина);
			СтруктураПараметров.Вставить("ФормироватьСчетНаОплату", Ложь);
		КонецЕсли;
			
	ИначеЕсли ИмяДокумента = "уатЗаказГрузоотправителя" Тогда
		Если ТипЗнч(ДопПараметры) = Тип("Структура") И ДопПараметры.Свойство("ВидыТД") Тогда
			СтруктураПараметров.Вставить("ФормироватьРеализацию", ДопПараметры.ВидыТД.Найти("ЗаказНаТС_Реализация") <> Неопределено);
			СтруктураПараметров.Вставить("ФормироватьСчетНаОплату", ДопПараметры.ВидыТД.Найти("ЗаказНаТС_Счет") <> Неопределено);
		Иначе
			СтруктураПараметров.Вставить("ФормироватьРеализацию", Истина);
			СтруктураПараметров.Вставить("ФормироватьСчетНаОплату", Ложь);
		КонецЕсли;
		
	ИначеЕсли ИмяДокумента = "уатОперацииСТехническимиЖидкостями" Тогда
		СтруктураПараметров.Вставить("ФормироватьОприход", ДокументУАТ.ВидОперации = Перечисления.уатВидыОперацийСТехническимиЖидкостями.Слив);
		СтруктураПараметров.Вставить("ФормироватьТребНакл", ДокументУАТ.ВидОперации <> Перечисления.уатВидыОперацийСТехническимиЖидкостями.Слив);
		
	ИначеЕсли ИмяДокумента = "уатСливГСМ" Тогда
		СтруктураПараметров.Вставить("ФормироватьВозвратПоставщику", ДокументУАТ.ВидОперации = Перечисления.уатВидыОперацийСливГСМ.НаАЗС);
		
		Если ДокументУАТ.ВидОперации = Перечисления.уатВидыОперацийСливГСМ.НаСклад Тогда
			Если ТипЗнч(ДопПараметры) = Тип("Структура") И ДопПараметры.Свойство("ВидыТД") Тогда
				СтруктураПараметров.Вставить("ФормироватьОприход", ДопПараметры.ВидыТД.Найти("СливГСМ_Оприходование") <> Неопределено);
				СтруктураПараметров.Вставить("ФормироватьПеремещение", ДопПараметры.ВидыТД.Найти("СливГСМ_Перемещение") <> Неопределено);
			Иначе
				СтруктураПараметров.Вставить("ФормироватьОприход", Истина);
				СтруктураПараметров.Вставить("ФормироватьПеремещение", Ложь);
			КонецЕсли;
		Иначе
			СтруктураПараметров.Вставить("ФормироватьОприход", Ложь);
			СтруктураПараметров.Вставить("ФормироватьПеремещение", Ложь);
		КонецЕсли;
				
	КонецЕсли;
	
	НаборЗаписейТД	= РегистрыСведений.уатТиповыеДокументы.СоздатьНаборЗаписей();
	НаборЗаписейТД.мДокументУАТ	= ДокументУАТ;
	ВсеОк = НаборЗаписейТД.ФормированиеТД(СтруктураПараметров); // ИЛИ Не Отказ;
КонецПроцедуры

Функция ПроведениеДокументаУАТразрешено(ДокументУАТ) Экспорт
	МетаданныеДокумента = ДокументУАТ.Метаданные();
	Возврат (МетаданныеДокумента.Проведение = Метаданные.СвойстваОбъектов.Проведение.Разрешить);
КонецФункции

// Процедура ищет типовой документ для документа УАТ
// 
Функция НайтиТиповойДокументДляДокументаУАТ(вхДокументУАТ, выхТиповойДокумент = Неопределено, выхПредупреждение = "") Экспорт
	
	Запрос = Новый Запрос();
	Запрос.УстановитьПараметр("ДокументУАТ", вхДокументУАТ);
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	уатТиповыеДокументы.ТиповойДокумент
	|ИЗ
	|	РегистрСведений.уатТиповыеДокументы КАК уатТиповыеДокументы
	|ГДЕ
	|	уатТиповыеДокументы.ДокументУАТ = &ДокументУАТ
	|	И НЕ уатТиповыеДокументы.ТиповойДокумент.ПометкаУдаления
	|
	|УПОРЯДОЧИТЬ ПО
	|	уатТиповыеДокументы.ТиповойДокумент.Дата УБЫВ,
	|	уатТиповыеДокументы.ТиповойДокумент.Номер УБЫВ";
	
	УстановитьПривилегированныйРежим(Истина);
	
	РезультатЗапроса = Запрос.Выполнить().Выбрать();
	
	выхТиповойДокумент = Новый Массив;
	Результат = Ложь;
	
	текстТиповыеДокументы = "";
	
	мВидДокумента = Неопределено;
	Пока РезультатЗапроса.Следующий() Цикл
		Если мВидДокумента <> ТипЗнч(РезультатЗапроса.ТиповойДокумент) Тогда
			выхТиповойДокумент.Добавить(РезультатЗапроса.ТиповойДокумент);
			текстТиповыеДокументы = текстТиповыеДокументы + "
				|	- " + РезультатЗапроса.ТиповойДокумент + ";";
			Результат = Истина;
			мВидДокумента = ТипЗнч(РезультатЗапроса.ТиповойДокумент);
		КонецЕсли;
	КонецЦикла;
	
	Если текстТиповыеДокументы <> "" Тогда
		текстТиповыеДокументы = Лев(текстТиповыеДокументы, СтрДлина(текстТиповыеДокументы)-1);
	КонецЕсли;
	
	Если выхТиповойДокумент.Количество() = 0 Тогда
		выхТиповойДокумент = Неопределено;
	ИначеЕсли выхТиповойДокумент.Количество() = 1 Тогда
		выхТиповойДокумент = выхТиповойДокумент[0];
	КонецЕсли;
	
	Если выхТиповойДокумент <> Неопределено Тогда
		выхПредупреждение = "Для данного документа сформированы документы типовой конфигурации:" + текстТиповыеДокументы + ".
			|Документ будет открыт в режиме просмотра!";
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат Результат;
	
КонецФункции

Функция ЕстьПравоРедактированияРегистраТД() Экспорт
	
	Возврат ПравоДоступа("Изменение", Метаданные.РегистрыСведений.уатТиповыеДокументы);
	
КонецФункции // ЕстьПравоРедактированияРегистраТД()

#КонецОбласти
